04_Simulation/2.IN_THE_LOOP/PH_gen100_pop100_symUK-Cf_parIs/running_pfac150_pop100_seed0/run_01203/PH_2D_RANS_kOmegaSSTx/system/sampleDictCF.bkp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat csv;

interpolationScheme cellPoint;

fields
(
    wallShearStress
);

sets
(
    Y0H
    {
        type        patchCloud;
        axis        x;
        points      (
                    (0.10 1.00 0.00)
                    (0.40 0.93 0.00)
                    (0.70 0.69 0.00)
                    (1.00 0.45 0.00)
                    (1.30 0.22 0.00)
                    (1.60 0.06 0.00)
                    (1.90 0.00 0.00)
                    (2.20 0.00 0.00)
                    (2.50 0.00 0.00)
                    (2.80 0.00 0.00)
                    (3.10 0.00 0.00)
                    (3.40 0.00 0.00)
                    (3.70 0.00 0.00)
                    (4.00 0.00 0.00)
                    (4.30 0.00 0.00)
                    (4.60 0.00 0.00)
                    (4.90 0.00 0.00)
                    (5.20 0.00 0.00)
                    (5.50 0.00 0.00)
                    (5.80 0.00 0.00)
                    (6.10 0.00 0.00)
                    (6.40 0.00 0.00)
                    (6.70 0.00 0.00)
                    (7.00 0.00 0.00)
                    (7.30 0.03 0.00)
                    (7.60 0.16 0.00)
                    (7.90 0.37 0.00)
                    (8.20 0.61 0.00)
                    (8.80 0.99 0.00)
                    );
        maxDistance 0.1;
        patches     ("hills");
    }
);
// *********************************************************************** //
